--- a/src/pages/archi/poo.md
+++ b/src/pages/archi/poo.md
@@ -352,36 +348,31 @@ ma_voiture._methode_privee() # interdit (hors de la classe)
 
 En POO une classe peut **hériter** des caractéristiques (attributs, méthodes) d’une autre classe.
 
-```plantuml
-@startuml
-
+```mermaid
+---
 title: Exemple d'héritage
+---
+classDiagram
+    class Vehicule {
+        #String nom
+        #double poids
+        #double prix
+        #double vitesse
+        +accelerer() void
+    }
 
-class Vehicule {
-    # nom: String
-    # poids: double
-    # prix: double
-    # vitesse: double
-    ---
-    + accelerer() : void
-}
+    class Voiture {
+        -int nombre_portes
+        +accelerer() void
+    }
 
-class Voiture {
-    - nombre_portes: int
-    --
-    + accelerer() : void
-}
+    class Avion {
+        -double capacite_soute
+        +accelerer() void
+    }
 
-class Avion {
-    - capacite_soute : double
-    --
-    + accelerer() : void
-}
-
-Vehicule <|-- Voiture : Extends
-Vehicule <|-- Avion : Extends
-
-@enduml
+    Vehicule <|-- Voiture : Extends
+    Vehicule <|-- Avion : Extends
 ```
 
 <div class="caption">Un exemple d'héritage.</div>
